echo on

# read_verilog ../src/rtl/processor_example.v
read_verilog ../src/rtl/processor.v

# synth
# abc -g NAND

synth_ice40
stat